tutorials/heatTransfer/chtMultiRegionFoam/multiRegionHeaterRadiation/0/bottomAir/G
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/bottomAir";
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 0 -3 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    "(min|max)(X|Y|Z)"
    {
        type            MarshakRadiation;
        value           $internalField;
        emissivityMode  lookup;
        emissivity      uniform 1;
    }
    "bottomAir_to_.*"
    {
        type            MarshakRadiation;
        value           $internalField;
        emissivityMode  solidRadiation;
        emissivity      uniform 1;
    }
}


// ************************************************************************* //
