tutorials/heatTransfer/chtMultiRegionFoam/multiRegionHeaterRadiation/constant/rightSolid/SYMLINKS.txt
The original source for 'radiationProperties' was '../heater/radiationProperties'
The original source for 'thermophysicalProperties' was '../heater/thermophysicalProperties'
