tutorials/heatTransfer/chtMultiRegionFoam/multiRegionHeaterRadiation/constant/topAir/SYMLINKS.txt
The original source for 'g' was '../bottomAir/g'
The original source for 'radiationProperties' was '../bottomAir/radiationProperties'
The original source for 'thermophysicalProperties' was '../bottomAir/thermophysicalProperties'
The original source for 'turbulenceProperties' was '../bottomAir/turbulenceProperties'
