tutorials/heatTransfer/chtMultiRegionFoam/multiRegionHeaterRadiation/system/bottomAir/SYMLINKS.txt
The original source for 'decomposeParDict' was '../decomposeParDict'
