tutorials/heatTransfer/chtMultiRegionFoam/multiRegionHeaterRadiation/system/heater/SYMLINKS.txt
The original source for 'decomposeParDict' was '../decomposeParDict'
